app/controllers/comments_controller.rb

SELECT * FROM "proposals" WHERE ("proposals"."id" = 8)
---
  def index
    @proposal = Proposal.find(params['proposal_id'])

SELECT * FROM "proposals" WHERE ("proposals"."id" = 11)
SELECT * FROM "comments" WHERE ("comments"."id" = 11 AND ("comments".proposal_id = 11))
---
  def show
    @proposal = Proposal.find(params['proposal_id'])
    @comment = @proposal.comments.find(params[:id])

SELECT * FROM "proposals" WHERE ("proposals"."id" = 6)
---
  def new
    @proposal = Proposal.find(params['proposal_id'])

SELECT * FROM "proposals" WHERE ("proposals"."id" = 8)
INSERT INTO "comments" ("name", "updated_at", "title", "content", "avatar", "proposal_id", "created_at") VALUES('Phil', '2009-06-21 01:47:48', 'Title', 'Content text', 'http://s3.amazonaws.com/twitpic/photos/full/13234667.jpg?AWSAccessKeyId=0ZRYP5X5F6FSMBCCSE82&Expires=1245549834&Signature=hoeu00LBFnZELPKBSmHHcoQLMWQ%3D', 11, '2009-06-21 01:47:48')
---
  def create
    @proposal = Proposal.find(params['proposal_id'])
    @comment = @proposal.comments.build(params[:comment])


    respond_to do |format|
      if @comment.save