app/controllers/comments_controller.rb

  def index
    @site = Site.find(params['site_id'])
    @comments = @site.comments.all
---
SELECT * FROM "comments" WHERE ("comments".proposal_id = 8)

  def new
    @site = Site.find(params['site_id'])
---
SELECT * FROM "sites" WHERE ("sites"."id" = 7)