app/controllers/proposals_controller.rb

  def index
    @site = Site.find(params['site_id'])
    @proposals = @site.proposals.all
---
SELECT * FROM "sites" WHERE ("sites"."id" = 1)
SELECT * FROM "proposals" WHERE ("proposals".site_id = 1)

  def show
    @site = Site.find(params['site_id'])
    @proposal = @site.proposals.find(params[:id])
---
SELECT * FROM "sites" WHERE ("sites"."id" = 1)
SELECT * FROM "proposals" WHERE ("proposals"."id" = 1 AND ("proposals".site_id = 1))

  def new
    @site = Site.find(params['site_id'])
---
SELECT * FROM "sites" WHERE ("sites"."id" = 1)

  def edit
    @site = Site.find(params['site_id'])
    @proposal = @site.proposals.find(params[:id])
---
SELECT * FROM "sites" WHERE ("sites"."id" = 2)
SELECT * FROM "proposals" WHERE ("proposals"."id" = 1 AND ("proposals".site_id = 2))

  def create
    @site = Site.find(params['site_id'])
    @proposal = @site.proposals.build(params[:proposal])

    respond_to do |format|
      if @proposal.save
---
SELECT * FROM "sites" WHERE ("sites"."id" = 1)
INSERT INTO "proposals" ("site_id", "updated_at", "title", "flash_data", "description", "created_at") VALUES(2, '2009-06-21 11:45:42', 'asdf', NULL, '', '2009-06-21 11:45:42')

  def update
    @site = Site.find(params['site_id'])
    @proposal = @site.proposals.find(params[:id])

    respond_to do |format|
      if @proposal.update_attributes(params[:proposal])
---
SELECT * FROM "sites" WHERE ("sites"."id" = 9)
SELECT * FROM "proposals" WHERE ("proposals"."id" = 6 AND ("proposals".site_id = 9))
UPDATE "proposals" SET "title" = 'asgdf', "updated_at" = '2009-06-21 02:01:26' WHERE "id" = 6