app/controllers/sites_controller.rb

    def data
      @sites = Site.all
---
SELECT * FROM "sites"

  def index
    if params[:tag]
      @sites = Site.all(:conditions => ["tag LIKE ?", "%#{params[:tag]}%"])
---
SELECT * FROM "sites" WHERE (tag LIKE '%tag1%')

  def heatmap
    @sites = Site.all
---
SELECT * FROM "sites"

  def home
    @sites = Site.all
---
SELECT * FROM "sites"

  def show
    @site = Site.find(params[:id])
---
SELECT * FROM "sites" WHERE ("sites"."id" = 1)

  def edit
    @site = Site.find(params[:id])
---
SELECT * FROM "sites" WHERE ("sites"."id" = 2)

  def create
    @site = Site.new(params[:site])

    respond_to do |format|
      if @site.save
---
INSERT INTO "sites" ("photo", "latitude", "created_at", "title", "updated_at", "longitude", "description") VALUES('http://lh4.ggpht.com/_ax3--cJ7Ulw/SbprG5aa1gI/AAAAAAAAADI/qQcXKEPy8gI/s512/24.jpg', 52, '2009-06-20 16:33:44', 'A house', '2009-06-20 16:33:44', 0, 'Somewhere near my house')

  def update
    @site = Site.find(params[:id])

    respond_to do |format|
      if @site.update_attributes(params[:site])
---
SELECT * FROM "sites" WHERE ("sites"."id" = 2)
UPDATE "sites" SET "photo" = 'http://web1.twitpic.com/img/13434443-e17392709e1a4022534af9373d0f1c94.4a3e1ad1-scaled.jpg', "updated_at" = '2009-06-21 11:34:54' WHERE "id" = 1

  def destroy
    @site = Site.find(params[:id])
    @site.destroy
---
SELECT * FROM "sites" WHERE ("sites"."id" = 2)
DELETE FROM "sites" WHERE "id" = 2